RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_usart.c
/**
 *******************************************************************************
 * @file  hc32f4a0_usart.c
 * @brief This file provides firmware functions to manage the USART(Universal
 *        Synchronous/Asynchronous Receiver Transmitter).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Hongjh          First version
   2020-07-03       Hongjh          Add doxygen group:USART_Local_Functions.
   2020-08-25       Hongjh          The variable f32Err un-initializes an
                                    unnecessary assignment.
   2020-10-19       Hongjh          Modify USART initialization function.
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_usart.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_USART USART
 * @brief USART Driver Library
 * @{
 */

#if (DDL_USART_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup USART_Local_Macros USART Local Macros
 * @{
 */

/**
 * @defgroup USART_Check_Parameters_Validity USART Check Parameters Validity
 * @{
 */

#define IS_USART_INSTANCE(x)                                                   \
(   (M4_USART1 == (x))                          ||                             \
    (M4_USART2 == (x))                          ||                             \
    (M4_USART3 == (x))                          ||                             \
    (M4_USART4 == (x))                          ||                             \
    (M4_USART5 == (x))                          ||                             \
    (M4_USART6 == (x))                          ||                             \
    (M4_USART7 == (x))                          ||                             \
    (M4_USART8 == (x))                          ||                             \
    (M4_USART9 == (x))                          ||                             \
    (M4_USART10 == (x)))

#define IS_USART_SMARTCARD_INSTANCE(x)                                         \
(   (M4_USART1 == (x))                          ||                             \
    (M4_USART2 == (x))                          ||                             \
    (M4_USART3 == (x))                          ||                             \
    (M4_USART4 == (x))                          ||                             \
    (M4_USART6 == (x))                          ||                             \
    (M4_USART7 == (x))                          ||                             \
    (M4_USART8 == (x))                          ||                             \
    (M4_USART9 == (x)))

#define IS_USART_LIN_INSTANCE(x)                                               \
(   (M4_USART5 == (x))                          ||                             \
    (M4_USART10 == (x)))

#define IS_USART_STOPMODE_INSTANCE(x)           (M4_USART1 == (x))

#define IS_USART_TIMEOUT_INSTANCE(x)                                           \
(   (M4_USART1 == (x))                          ||                             \
    (M4_USART2 == (x))                          ||                             \
    (M4_USART5 == (x))                          ||                             \
    (M4_USART6 == (x)))

#define IS_USART_FRACTION_INSTANCE(x)                                          \
(   (M4_USART1 == (x))                          ||                             \
    (M4_USART2 == (x))                          ||                             \
    (M4_USART3 == (x))                          ||                             \
    (M4_USART4 == (x))                          ||                             \
    (M4_USART6 == (x))                          ||                             \
    (M4_USART7 == (x))                          ||                             \
    (M4_USART8 == (x))                          ||                             \
    (M4_USART9 == (x)))

#define IS_USART_FUNCTION(x)                                                   \
(   (0UL != (x))                                &&                             \
    (0UL == ((x) & (~USART_FUNCTION_MASK))))

#define IS_USART_LIN_FUNCTION(x)                                               \
(   (0UL != (x))                                &&                             \
    (0UL == ((x) & (~USART_LIN_FUNCTION_MASK))))

#define IS_USART_FLAG(x)                                                       \
(   (0UL != (x))                                &&                             \
    (0UL == ((x) & (~USART_FLAG_MASK))))

#define IS_USART_CLEAR_FLAG(x)                                                 \
(   (0UL != (x))                                &&                             \
    (0UL == ((x) & (~USART_CLEAR_FLAG_MASK))))

#define IS_USART_TRANSMISSION_TYPE(x)                                          \
(   (USART_TRANSMISSION_ID == (x))              ||                             \
    (USART_TRANSMISSION_DATA == (x)))

#define IS_USART_PARITY_CONTROL(x)                                             \
(   (USART_PARITY_ODD == (x))                   ||                             \
    (USART_PARITY_EVEN == (x))                  ||                             \
    (USART_PARITY_NONE == (x)))

#define IS_USART_DATA_WIDTH(x)                                                 \
(   (USART_DATA_LENGTH_8BIT == (x))             ||                             \
    (USART_DATA_LENGTH_9BIT == (x)))

#define IS_USART_NOISE_FILTER(x)                                               \
(   (USART_NOISE_FILTER_ENABLE == (x))          ||                             \
    (USART_NOISE_FILTER_DISABLE == (x)))

#define IS_USART_OVERSAMPLING_BITS(x)                                          \
(   (USART_OVERSAMPLING_8BIT == (x))            ||                             \
    (USART_OVERSAMPLING_16BIT == (x)))

#define IS_USART_SIGNIFICANT_BIT(x)                                            \
(   (USART_MSB == (x))                          ||                             \
    (USART_LSB == (x)))

