RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_usart.c
#define IS_USART_SB_DETECT_POLARITY(x)                                         \
(   (USART_SB_DETECT_LOW == (x))                ||                             \
    (USART_SB_DETECT_FALLING == (x)))

#define IS_USART_CLOCK_MODE(x)                                                 \
(   (USART_EXTCLK == (x))                       ||                             \
    (USART_INTERNCLK_OUTPUT == (x))             ||                             \
    (USART_INTERNCLK_NONE_OUTPUT == (x)))

#define IS_USART_SMARTCARD_CLOCK_MODE(x)                                       \
(   (USART_INTERNCLK_OUTPUT == (x))             ||                             \
    (USART_INTERNCLK_NONE_OUTPUT == (x)))

#define IS_USART_CLKSYNC_CLOCK_MODE(x)                                         \
(   (USART_EXTCLK == (x))                       ||                             \
    (USART_INTERNCLK_OUTPUT == (x)))

#define IS_USART_STOP_BITS(x)                                                  \
(   (USART_STOPBIT_1BIT == (x))                 ||                             \
    (USART_STOPBIT_2BIT == (x)))

#define IS_UART_DUPLEX_MODE(x)                                                 \
(   (USART_HALFDUPLEX_MODE == (x))              ||                             \
    (USART_FULLDUPLEX_MODE == (x)))

#define IS_USART_HWFLOWCTRL(x)                                                 \
(   (USART_HWFLOWCTRL_NONE == (x))              ||                             \
    (USART_HWFLOWCTRL_CTS == (x))               ||                             \
    (USART_HWFLOWCTRL_RTS == (x))               ||                             \
    (USART_HWFLOWCTRL_RTS_CTS == (x)))

#define IS_USART_PCLK_DIV(x)                                                   \
(   (USART_PCLK_DIV1 == (x))                    ||                             \
    (USART_PCLK_DIV4 == (x))                    ||                             \
    (USART_PCLK_DIV16 == (x))                   ||                             \
    (USART_PCLK_DIV64 == (x)))

#define IS_USART_LIN_BMC_PCLK_DIV(x)                                           \
(   (USART_LIN_BMC_PCLK_DIV1 == (x))            ||                             \
    (USART_LIN_BMC_PCLK_DIV2 == (x))            ||                             \
    (USART_LIN_BMC_PCLK_DIV4 == (x))            ||                             \
    (USART_LIN_BMC_PCLK_DIV8 == (x)))

#define IS_USART_STOPMODE_FILTER(x)                                            \
(   (USART_STOP_MODE_FILTER_NONE == (x))            ||                         \
    (USART_STOP_MODE_FILTER_WIDTH_LEVEL_1 == (x))   ||                         \
    (USART_STOP_MODE_FILTER_WIDTH_LEVEL_2 == (x))   ||                         \
    (USART_STOP_MODE_FILTER_WIDTH_LEVEL_3 == (x))   ||                         \
    (USART_STOP_MODE_FILTER_WIDTH_LEVEL_4 == (x)))

#define IS_USART_SMARTCARD_ETU_CLK(x)                                          \
(   (USART_SC_ETU_CLK_32 == (x))                ||                             \
    (USART_SC_ETU_CLK_64 == (x))                ||                             \
    (USART_SC_ETU_CLK_128 == (x))               ||                             \
    (USART_SC_ETU_CLK_256 == (x))               ||                             \
    (USART_SC_ETU_CLK_372 == (x)))

#define IS_USART_LIN_SEND_BREAK_MODE(x)                                        \
(   (USART_LIN_SEND_BREAK_MODE_SBK == (x))      ||                             \
    (USART_LIN_SEND_BREAK_MODE_TDR == (x)))

#define IS_USART_LIN_DETECT_BREAK_LEN(x)                                       \
(   (USART_LIN_DETECT_BREAK_10BIT == (x))       ||                             \
    (USART_LIN_DETECT_BREAK_11BIT == (x)))

#define IS_USART_LIN_SEND_BREAK_LEN(x)                                         \
(   (USART_LIN_SEND_BREAK_10BIT == (x))         ||                             \
    (USART_LIN_SEND_BREAK_11BIT == (x))         ||                             \
    (USART_LIN_SEND_BREAK_13BIT == (x))         ||                             \
    (USART_LIN_SEND_BREAK_14BIT == (x)))

/**
 * @}
 */

/**
 * @defgroup USART_Flag_Mask USART flag mask definition
 * @{
 */
#define USART_FLAG_MASK                     (USART_FLAG_PE      |              \
                                             USART_FLAG_FE      |              \
                                             USART_FLAG_ORE     |              \
                                             USART_FLAG_BE      |              \
                                             USART_FLAG_RXNE    |              \
                                             USART_FLAG_TC      |              \
                                             USART_FLAG_TXE     |              \
                                             USART_FLAG_RTOF    |              \
                                             USART_FLAG_LBD     |              \
                                             USART_FLAG_WKUP    |              \
                                             USART_FLAG_MPB)
/**
 * @}
 */

/**
 * @defgroup USART_Clear_Flag_Mask USART clear flag mask definition
 * @{
 */
#define USART_CLEAR_FLAG_MASK               (USART_CLEAR_FLAG_PE    |          \
                                             USART_CLEAR_FLAG_FE    |          \
                                             USART_CLEAR_FLAG_ORE   |          \
                                             USART_CLEAR_FLAG_RTOF  |          \
                                             USART_CLEAR_FLAG_BE    |          \
                                             USART_CLEAR_FLAG_WKUP  |          \
                                             USART_CLEAR_FLAG_LBD)
/**
 * @}
 */

/**
 * @defgroup USART_function_Mask USART function mask definition
 * @{
 */
#define USART_FUNCTION_MASK                 (USART_RX       |                  \
                                             USART_TX       |                  \
                                             USART_RTO      |                  \
                                             USART_INT_RX   |                  \
                                             USART_INT_TC   |                  \
                                             USART_INT_TXE  |                  \
                                             USART_INT_RTO)
/**
 * @}
 */

/**
 * @defgroup USART_LIN_function_Mask USART LIN function mask definition
 * @{
 */
#define USART_LIN_FUNCTION_MASK             (USART_LIN              |          \
                                             USART_LIN_WKUP         |          \
                                             USART_LIN_BUSERR       |          \
                                             USART_LIN_INT_WKUP     |          \
                                             USART_LIN_INT_BREAK    |          \
                                             USART_LIN_INT_BUSERR)
/**
 * @}
 */

/**
 * @defgroup USART_CR1_Clear_Flag_Mask USART register clear flag bits mask definition
 * @{
 */
#define USART_CR1_CLR_FLAG_MASK             (USART_CR1_CPE      |              \
                                             USART_CR1_CORE     |              \
                                             USART_CR1_CFE      |              \
                                             USART_CR1_CRTOF    |              \
                                             USART_CR1_CBE      |              \
                                             USART_CR1_CWKUP    |              \
                                             USART_CR1_CLBD)
/**
 * @}
 */

/**
 * @defgroup USART_CR2_Reserved_Bit USART CR2 register reserved bit 9/10 definition
 * @{
 */
#define USART_CR2_BIT9                      (0x00000200UL)
#define USART_CR2_BIT10                     (0x00000400UL)
/**
 * @}
 */

/**
 * @defgroup USART_Clk_Frequency USART Clk Frequency
 * @{
 */
#define USART_DIV(INSTANCE)                                                    \
(   1UL << (READ_REG32_BIT((INSTANCE)->PR, USART_PR_PSC) * 2UL))

#define USART_BMC_DIV(INSTANCE)                                                \
(   1UL << (READ_REG32_BIT((INSTANCE)->PR, USART_PR_LBMPSC) >> USART_PR_LBMPSC_POS))

#define PCLK_FREQ                                                              \
(   SystemCoreClock >> (READ_REG32_BIT(M4_CMU->SCFGR, CMU_SCFGR_PCLK1S) >> CMU_SCFGR_PCLK1S_POS))
/**
 * @}
 */

/**
 * @}
 */

