RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_usart.c
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
/**
 * @addtogroup USART_Local_Functions
 * @{
 */

static en_result_t CalcUartBaudrate(const M4_USART_TypeDef *USARTx,
                                        uint32_t u32UartClk,
                                        uint32_t u32Baudrate,
                                        uint32_t *pu32BrrVal,
                                        uint32_t *pu32FractEn,
                                        float32_t *pf32Err);
static en_result_t CalcClkSyncBaudrate(const M4_USART_TypeDef *USARTx,
                                            uint32_t u32UsartClk,
                                            uint32_t u32Baudrate,
                                            uint32_t *pu32BrrVal,
                                            uint32_t *pu32FractEn,
                                            float32_t *pf32Err);
static en_result_t CalcSmartcardBaudrate(const M4_USART_TypeDef *USARTx,
                                            uint32_t u32UartClk,
                                            uint32_t u32Baudrate,
                                            uint32_t *pu32BrrVal,
                                            uint32_t *pu32FractEn,
                                            float32_t *pf32Err);

/**
 * @}
 */

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup USART_Global_Functions USART Global Functions
 * @{
 */

/**
 * @brief  Initialize UART function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] pstcInit                Pointer to a @ref stc_usart_uart_init_t structure.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: the pointer pstcInit is NULL or baudrate set unsuccessfully
 */
en_result_t USART_UartInit(M4_USART_TypeDef *USARTx,
                            const stc_usart_uart_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        /* Check parameters */
        DDL_ASSERT(IS_USART_INSTANCE(USARTx));
        DDL_ASSERT(IS_USART_CLOCK_MODE(pstcInit->u32ClkMode));
        DDL_ASSERT(IS_USART_PARITY_CONTROL(pstcInit->u32Parity));
        DDL_ASSERT(IS_USART_DATA_WIDTH(pstcInit->u32DataWidth));
        DDL_ASSERT(IS_USART_STOP_BITS(pstcInit->u32StopBit));
        DDL_ASSERT(IS_USART_OVERSAMPLING_BITS(pstcInit->u32OversamplingBits));
        DDL_ASSERT(IS_USART_SIGNIFICANT_BIT(pstcInit->u32BitDirection));
        DDL_ASSERT(IS_USART_NOISE_FILTER(pstcInit->u32NoiseFilterState));
        DDL_ASSERT(IS_USART_SB_DETECT_POLARITY(pstcInit->u32SbDetectPolarity));
        DDL_ASSERT(IS_USART_HWFLOWCTRL(pstcInit->u32HwFlowCtrl));

        /* Disbale TX/RX && clear flag */
        WRITE_REG32(USARTx->CR1, USART_CR1_CLR_FLAG_MASK);

        /* Set CR2 */
        WRITE_REG32(USARTx->CR2, (USART_CR2_BIT9 | \
                                  USART_CR2_BIT10 | \
                                  pstcInit->u32ClkMode |
                                  pstcInit->u32StopBit));

        /* Set CR3 */
        WRITE_REG32(USARTx->CR3, pstcInit->u32HwFlowCtrl);

        /* Set CR1 */
        WRITE_REG32(USARTx->CR1, (pstcInit->u32Parity | \
                                  pstcInit->u32DataWidth | \
                                  pstcInit->u32OversamplingBits | \
                                  pstcInit->u32BitDirection | \
                                  pstcInit->u32NoiseFilterState | \
                                  pstcInit->u32SbDetectPolarity));

        /* Set LBMC */
        WRITE_REG32(USARTx->LBMC, 0UL);

        if (USART_EXTCLK != pstcInit->u32ClkMode)
        {
            DDL_ASSERT(IS_USART_PCLK_DIV(pstcInit->u32PclkDiv));

            /* Set PR */
            WRITE_REG32(USARTx->PR, pstcInit->u32PclkDiv);

            /* Set baudrate */
            enRet = USART_SetBaudrate(USARTx, pstcInit->u32Baudrate, NULL);
        }
        else
        {
            enRet = Ok;
        }
    }

    return enRet;
}

/**
 * @brief  Initialize UART half duplex function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] pstcInit                Pointer to a @ref stc_usart_uart_init_t structure.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: the pointer pstcInit is NULL or baudrate set unsuccessfully
 */
en_result_t USART_HalfduplexInit(M4_USART_TypeDef *USARTx,
                                    const stc_usart_uart_init_t *pstcInit)
{
    en_result_t enRet;

    enRet = USART_UartInit(USARTx, pstcInit);
    if (Ok == enRet)
    {
        /* Set CR3: UART half duplex */
        SET_REG32_BIT(USARTx->CR3, USART_CR3_HDSEL);
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_usart_uart_init_t to default values.
 * @param  [out] pstcInit               Pointer to a @ref stc_usart_uart_init_t structure.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: the pointer pstcInit is NULL
 */
en_result_t USART_UartStructInit(stc_usart_uart_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

