RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_usart.c
    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u32Baudrate = 9600UL;
        pstcInit->u32ClkMode = USART_INTERNCLK_NONE_OUTPUT;
        pstcInit->u32PclkDiv = USART_PCLK_DIV1;
        pstcInit->u32Parity = USART_PARITY_NONE;
        pstcInit->u32DataWidth = USART_DATA_LENGTH_8BIT;
        pstcInit->u32StopBit = USART_STOPBIT_1BIT;
        pstcInit->u32OversamplingBits = USART_OVERSAMPLING_16BIT;
        pstcInit->u32BitDirection = USART_LSB;
        pstcInit->u32NoiseFilterState = USART_NOISE_FILTER_DISABLE;
        pstcInit->u32SbDetectPolarity = USART_SB_DETECT_FALLING;
        pstcInit->u32HwFlowCtrl = USART_HWFLOWCTRL_NONE;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Initialize UART multiple processor function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] pstcInit                Pointer to a @ref stc_usart_multiprocessor_init_t structure.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: the pointer pstcInit is NULL or baudrate set unsuccessfully
 */
en_result_t USART_MultiProcessorInit(M4_USART_TypeDef *USARTx,
                                const stc_usart_multiprocessor_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        /* Check parameters */
        DDL_ASSERT(IS_USART_INSTANCE(USARTx));
        DDL_ASSERT(IS_USART_CLOCK_MODE(pstcInit->u32ClkMode));
        DDL_ASSERT(IS_USART_DATA_WIDTH(pstcInit->u32DataWidth));
        DDL_ASSERT(IS_USART_STOP_BITS(pstcInit->u32StopBit));
        DDL_ASSERT(IS_USART_OVERSAMPLING_BITS(pstcInit->u32OversamplingBits));
        DDL_ASSERT(IS_USART_SIGNIFICANT_BIT(pstcInit->u32BitDirection));
        DDL_ASSERT(IS_USART_NOISE_FILTER(pstcInit->u32NoiseFilterState));
        DDL_ASSERT(IS_USART_SB_DETECT_POLARITY(pstcInit->u32SbDetectPolarity));
        DDL_ASSERT(IS_USART_HWFLOWCTRL(pstcInit->u32HwFlowCtrl));

        /* Disbale TX/RX && clear flag */
        WRITE_REG32(USARTx->CR1, USART_CR1_CLR_FLAG_MASK);

        /* Set CR2 */
        WRITE_REG32(USARTx->CR2, (USART_CR2_MPE | \
                                  USART_CR2_BIT9 | \
                                  USART_CR2_BIT10 | \
                                  pstcInit->u32ClkMode | \
                                  pstcInit->u32StopBit));

        /* Set CR3 */
        WRITE_REG32(USARTx->CR3, pstcInit->u32HwFlowCtrl);

        /* Set CR1 */
        WRITE_REG32(USARTx->CR1, (pstcInit->u32DataWidth | \
                                  pstcInit->u32OversamplingBits | \
                                  pstcInit->u32BitDirection | \
                                  pstcInit->u32NoiseFilterState | \
                                  pstcInit->u32SbDetectPolarity));

        /* Set LBMC */
        WRITE_REG32(USARTx->LBMC, 0UL);

        if (USART_EXTCLK != pstcInit->u32ClkMode)
        {
            DDL_ASSERT(IS_USART_PCLK_DIV(pstcInit->u32PclkDiv));

            /* Set PR */
            WRITE_REG32(USARTx->PR, pstcInit->u32PclkDiv);

            /* Set baudrate */
            enRet = USART_SetBaudrate(USARTx, pstcInit->u32Baudrate, NULL);
        }
        else
        {
            enRet = Ok;
        }
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_usart_multiprocessor_init_t to default values.
 * @param  [out] pstcInit               Pointer to a @ref stc_usart_multiprocessor_init_t structure.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: the pointer pstcInit is NULL
 */
en_result_t USART_MultiProcessorStructInit(stc_usart_multiprocessor_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u32Baudrate = 9600UL;
        pstcInit->u32ClkMode = USART_INTERNCLK_NONE_OUTPUT;
        pstcInit->u32PclkDiv = USART_PCLK_DIV1;
        pstcInit->u32DataWidth = USART_DATA_LENGTH_8BIT;
        pstcInit->u32StopBit = USART_STOPBIT_1BIT;
        pstcInit->u32OversamplingBits = USART_OVERSAMPLING_16BIT;
        pstcInit->u32BitDirection = USART_LSB;
        pstcInit->u32NoiseFilterState = USART_NOISE_FILTER_DISABLE;
        pstcInit->u32SbDetectPolarity = USART_SB_DETECT_FALLING;
        pstcInit->u32HwFlowCtrl = USART_HWFLOWCTRL_NONE;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Initialize LIN function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] pstcInit                Pointer to a @ref stc_usart_lin_init_t structure.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: the pointer pstcInit is NULL or baudrate set unsuccessfully
 * @note   LIN feature is supported by M4_USART5/M4_USART10
 */
en_result_t USART_LinInit(M4_USART_TypeDef *USARTx,
                            const stc_usart_lin_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

