RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_usart.c
    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        /* Check parameters */
        DDL_ASSERT(IS_USART_LIN_INSTANCE(USARTx));
        DDL_ASSERT(IS_USART_CLOCK_MODE(pstcInit->u32ClkMode));
        DDL_ASSERT(IS_USART_OVERSAMPLING_BITS(pstcInit->u32OversamplingBits));
        DDL_ASSERT(IS_USART_LIN_DETECT_BREAK_LEN(pstcInit->u32DetectBreakLen));
        DDL_ASSERT(IS_USART_LIN_SEND_BREAK_LEN(pstcInit->u32SendBreakLen));
        DDL_ASSERT(IS_USART_LIN_SEND_BREAK_MODE(pstcInit->u32SendBreakMode));

        /* Disbale TX/RX && clear flag */
        WRITE_REG32(USARTx->CR1, USART_CR1_CLR_FLAG_MASK);

        /* Set CR2 */
        WRITE_REG32(USARTx->CR2, (USART_CR2_BIT9 | \
                                  USART_CR2_BIT10 | \
                                  pstcInit->u32ClkMode | \
                                  USART_CR2_LINEN | \
                                  pstcInit->u32DetectBreakLen | \
                                  pstcInit->u32SendBreakLen | \
                                  pstcInit->u32SendBreakMode));

        /* Set CR3 */
        WRITE_REG32(USARTx->CR3, 0UL);

        /* Set CR1 */
        WRITE_REG32(USARTx->CR1, (pstcInit->u32OversamplingBits | \
                                  USART_CR1_SBS));

        /* Set LBMC */
        WRITE_REG32(USARTx->LBMC, 0UL);

        if (USART_EXTCLK != pstcInit->u32ClkMode)
        {
            DDL_ASSERT(IS_USART_PCLK_DIV(pstcInit->u32PclkDiv));
            DDL_ASSERT(IS_USART_LIN_BMC_PCLK_DIV(pstcInit->u32BmcPclkDiv));

            /* Set PR */
            WRITE_REG32(USARTx->PR, (pstcInit->u32PclkDiv | \
                                     pstcInit->u32BmcPclkDiv));

            /* Set baudrate */
            enRet = USART_SetBaudrate(USARTx, pstcInit->u32Baudrate, NULL);
        }
        else
        {
            enRet = Ok;
        }
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_usart_lin_init_t to default values.
 * @param  [out] pstcInit               Pointer to a @ref stc_usart_lin_init_t structure.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: the pointer pstcInit is NULL
 */
en_result_t USART_LinStructInit(stc_usart_lin_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u32Baudrate = 9600UL;
        pstcInit->u32ClkMode = USART_INTERNCLK_NONE_OUTPUT;
        pstcInit->u32PclkDiv = USART_PCLK_DIV1;
        pstcInit->u32BmcPclkDiv = USART_LIN_BMC_PCLK_DIV1;
        pstcInit->u32OversamplingBits = USART_OVERSAMPLING_16BIT;
        pstcInit->u32DetectBreakLen = USART_LIN_DETECT_BREAK_10BIT;
        pstcInit->u32SendBreakLen = USART_LIN_SEND_BREAK_10BIT;
        pstcInit->u32SendBreakMode = USART_LIN_SEND_BREAK_MODE_SBK;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Initialize smartcard function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 * @param  [in] pstcInit                Pointer to a @ref stc_usart_smartcard_init_t structure.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: the pointer pstcInit is NULL or baudrate set unsuccessfully
 * @note   Smartcard feature is unsupported by M4_USART5/M4_USART10
 */
en_result_t USART_SmartcardInit(M4_USART_TypeDef *USARTx,
                                    const stc_usart_smartcard_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        /* Check parameters */
        DDL_ASSERT(IS_USART_SMARTCARD_INSTANCE(USARTx));
        DDL_ASSERT(IS_USART_SMARTCARD_CLOCK_MODE(pstcInit->u32ClkMode));
        DDL_ASSERT(IS_USART_PCLK_DIV(pstcInit->u32PclkDiv));
        DDL_ASSERT(IS_USART_SIGNIFICANT_BIT(pstcInit->u32BitDirection));

        /* Disbale TX/RX && clear flag */
        WRITE_REG32(USARTx->CR1, USART_CR1_CLR_FLAG_MASK);

        /* Set CR2 */
        WRITE_REG32(USARTx->CR2, (USART_CR2_BIT9 | \
                                  USART_CR2_BIT10 | \
                                  pstcInit->u32ClkMode | \
                                  pstcInit->u32StopBit));

        /* Set CR3 */
        WRITE_REG32(USARTx->CR3, USART_CR3_SCEN | USART_SC_ETU_CLK_372);

        /* Set CR1 */
        WRITE_REG32(USARTx->CR1, (USART_CR1_PCE | \
                                  pstcInit->u32BitDirection | \
                                  USART_CR1_SBS));

        /* Set PR */
        WRITE_REG32(USARTx->PR, pstcInit->u32PclkDiv);

        /* Set LBMC */
        WRITE_REG32(USARTx->LBMC, 0UL);

        /* Set baudrate */
        enRet = USART_SetBaudrate(USARTx, pstcInit->u32Baudrate, NULL);
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_usart_smartcard_init_t to default values.
 * @param  [out] pstcInit               Pointer to a @ref stc_usart_smartcard_init_t structure.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: the pointer pstcInit is NULL
 */
en_result_t USART_SmartcardStructInit(stc_usart_smartcard_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u32Baudrate = 9600UL;
        pstcInit->u32ClkMode = USART_INTERNCLK_NONE_OUTPUT;
        pstcInit->u32PclkDiv = USART_PCLK_DIV1;
        pstcInit->u32BitDirection = USART_LSB;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Initialize clock synchronization function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] pstcInit                Pointer to a @ref stc_usart_clksync_init_t structure.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: the pointer pstcInit is NULL or baudrate set unsuccessfully
 */
en_result_t USART_ClkSyncInit(M4_USART_TypeDef *USARTx,
                                const stc_usart_clksync_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

