RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_usart.c
    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        /* Check parameters */
        DDL_ASSERT(IS_USART_INSTANCE(USARTx));
        DDL_ASSERT(IS_USART_CLKSYNC_CLOCK_MODE(pstcInit->u32ClkMode));
        DDL_ASSERT(IS_USART_SIGNIFICANT_BIT(pstcInit->u32BitDirection));
        DDL_ASSERT(IS_USART_HWFLOWCTRL(pstcInit->u32HwFlowCtrl));

        /* Disbale TX/RX && clear flag */
        WRITE_REG32(USARTx->CR1, USART_CR1_CLR_FLAG_MASK);

        /* Set CR2 */
        WRITE_REG32(USARTx->CR2, (USART_CR2_BIT9 | \
                                  USART_CR2_BIT10 | \
                                  pstcInit->u32ClkMode));

        /* Set CR3 */
        WRITE_REG32(USARTx->CR3, pstcInit->u32HwFlowCtrl);

        /* Set CR1 */
        WRITE_REG32(USARTx->CR1, (USART_CR1_MS | \
                                  pstcInit->u32BitDirection | \
                                  USART_CR1_SBS));

        /* Set LBMC */
        WRITE_REG32(USARTx->LBMC, 0UL);

        if (USART_EXTCLK != pstcInit->u32ClkMode)
        {
            DDL_ASSERT(IS_USART_PCLK_DIV(pstcInit->u32PclkDiv));

            /* Set PR */
            WRITE_REG32(USARTx->PR, pstcInit->u32PclkDiv);

            /* Set baudrate */
            enRet = USART_SetBaudrate(USARTx, pstcInit->u32Baudrate, NULL);
        }
        else
        {
            enRet = Ok;
        }
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_usart_clksync_init_t to default values.
 * @param  [out] pstcInit               Pointer to a @ref stc_usart_clksync_init_t structure.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: the pointer pstcInit is NULL
 */
en_result_t USART_ClkSyncStructInit(stc_usart_clksync_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u32Baudrate = 9600UL;
        pstcInit->u32ClkMode = USART_INTERNCLK_NONE_OUTPUT;
        pstcInit->u32PclkDiv = USART_PCLK_DIV1;
        pstcInit->u32BitDirection = USART_LSB;
        pstcInit->u32HwFlowCtrl = USART_HWFLOWCTRL_NONE;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-Initialize USART function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @retval None
 */
void USART_DeInit(M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    /* Configures the registers to reset value. */
    WRITE_REG32(USARTx->CR1, USART_CR1_CLR_FLAG_MASK);
    WRITE_REG32(USARTx->PR, 0x00000000UL);
    WRITE_REG32(USARTx->BRR, 0x0000FF00UL);
    WRITE_REG32(USARTx->CR1, 0x80000000UL);
    WRITE_REG32(USARTx->CR2, 0x00000600UL);
    WRITE_REG32(USARTx->CR3, 0x00000000UL);
    WRITE_REG32(USARTx->LBMC, 0x00000000UL);
}

/**
 * @brief  Enable/disable USART Transmit/Receive Function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] u32Func                 USART function type
 *         This parameter can be any composed value of the following values:
 *           @arg USART_RX:             USART RX function
 *           @arg USART_TX:             USART TX function
 *           @arg USART_RTO:            USART RX timerout function
 *           @arg USART_INT_RX:         USART receive data register not empty && receive error interrupt
 *           @arg USART_INT_TE:         USART transmit data register empty interrupt
 *           @arg USART_INT_TC:         USART transmission complete interrupt
 *           @arg USART_INT_RTO:        USART RX timerout interrupt
 * @param  [in] enNewState              The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 * @note   USART RX timeout feature is supported by M4_USART1/M4_USART2/M4_USART5/M4_USART6
 */
void USART_FuncCmd(M4_USART_TypeDef *USARTx,
                        uint32_t u32Func,
                        en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_TIMEOUT_INSTANCE(USARTx) || \
               ((!IS_USART_TIMEOUT_INSTANCE(USARTx)) && (0UL == (u32Func & (USART_RTO | USART_INT_RTO)))));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_USART_FUNCTION(u32Func));

    (Enable == enNewState) ? SET_REG32_BIT(USARTx->CR1, u32Func) : CLEAR_REG32_BIT(USARTx->CR1, u32Func);
}

/**
 * @brief  Get USART function state.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] u32Func                 USART function type
 *         This parameter can be one of the following values:
 *           @arg USART_RX:             USART RX function
 *           @arg USART_TX:             USART TX function
 *           @arg USART_RTO:            USART RX timerout function
 *           @arg USART_INT_RX:         USART RX interrupt function
 *           @arg USART_INT_TXE:        Transmit data register empty interrupt
 *           @arg USART_INT_TC:         USART transmission complete interrupt
 *           @arg USART_INT_RTO:        USART RX timerout interrupt
 * @retval An en_functional_state_t enumeration value:
 *           - Enable: Enable function
 *           - Disable: Disable function
 */
en_functional_state_t USART_GetFuncState(const M4_USART_TypeDef *USARTx,
                                            uint32_t u32Func)
{
    /* Check parameters */
    DDL_ASSERT (IS_USART_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_FUNCTION(u32Func));

    return (READ_REG32_BIT(USARTx->CR1, u32Func) ? Enable : Disable);
}

/**
 * @brief  Get USART flag.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] u32Flag                 USART flag type
 *         This parameter can be any composed value of the following values:
 *           @arg USART_FLAG_PE:        Parity error flag
 *           @arg USART_FLAG_FE:        Framing error flag
 *           @arg USART_FLAG_ORE:       Overrun error flag
 *           @arg USART_FLAG_BE:        LIN bus error flag
 *           @arg USART_FLAG_RXNE:      Receive data register not empty flag
 *           @arg USART_FLAG_TC:        Transmission complete flag
 *           @arg USART_FLAG_TXE:       Transmit data register empty flag
 *           @arg USART_FLAG_MPB:       Receive processor ID flag
 *           @arg USART_FLAG_RTOF:      Receive timeout flag
 *           @arg USART_FLAG_LBD:       LIN break signal detection flag
 *           @arg USART_FLAG_WKUP:      LIN wakeup signal detection flag
 *           @arg USART_FLAG_MPB:       Receive processor ID flag
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t USART_GetStatus(const M4_USART_TypeDef *USARTx,
                                    uint32_t u32Flag)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_FLAG(u32Flag));

    return (READ_REG32_BIT(USARTx->SR, u32Flag) ? Set : Reset);
}

/**
 * @brief  Get USART flag.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] u32Flag                 USART flag type
 *         This parameter can be any composed value of the following values:
 *           @arg USART_CLEAR_FLAG_PE:  Clear Parity error flag
 *           @arg USART_CLEAR_FLAG_FE:  Clear Framing error flag
 *           @arg USART_CLEAR_FLAG_ORE: Clear Overrun error flag
 *           @arg USART_CLEAR_FLAG_RTOF:Clear RX timeout flag
 *           @arg USART_CLEAR_FLAG_BE:  Clear LIN bus error flag
 *           @arg USART_CLEAR_FLAG_WKUP:Clear LIN wakeup signal flag
 *           @arg USART_CLEAR_FLAG_LBD: Clear Clear LIN break detection flag
 * @retval None
 */
void USART_ClearStatus(M4_USART_TypeDef *USARTx, uint32_t u32Flag)
{
    /* Check parameters */
    DDL_ASSERT (IS_USART_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_CLEAR_FLAG(u32Flag));

    SET_REG32_BIT(USARTx->CR1, u32Flag);
}

/**
 * @brief  Set USART transmission type.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] u32Type                 USART transmission content type
 *         This parameter can be one of the following values:
 *           @arg USART_TRANSMISSION_ID     USART transmission content type is processor ID
 *           @arg USART_TRANSMISSION_DATA   USART transmission content type is frame data
 * @retval None
 */
void USART_SetTransmissionType(M4_USART_TypeDef *USARTx, uint32_t u32Type)
{
    /* Check parameters */
    DDL_ASSERT (IS_USART_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_TRANSMISSION_TYPE(u32Type));

    MODIFY_REG32(USARTx->DR, USART_DR_MPID, u32Type);
}

/**
 * @brief  Get USART transmission type.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_TRANSMISSION_ID     USART transmission content type is processor ID
 *           @arg USART_TRANSMISSION_DATA   USART transmission content type is frame data
 */
uint32_t USART_GetTransmissionType(const M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->DR, USART_DR_MPID);
}

/**
 * @brief  Set USART parity.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] u32Parity               USART parity
 *         This parameter can be one of the following values:
 *           @arg USART_PARITY_NONE:    Parity control disabled
 *           @arg USART_PARITY_ODD:     Parity control enabled and Odd Parity is selected
 *           @arg USART_PARITY_EVEN:    Parity control enabled and Even Parity is selected
 * @retval None
 */
void USART_SetParity(M4_USART_TypeDef *USARTx, uint32_t u32Parity)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_PARITY_CONTROL(u32Parity));

    MODIFY_REG32(USARTx->CR1, (USART_CR1_PS | USART_CR1_PCE), u32Parity);
}

/**
 * @brief  Get USART parity.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_PARITY_NONE:    Parity control disabled
 *           @arg USART_PARITY_ODD:     Parity control enabled and Odd Parity is selected
 *           @arg USART_PARITY_EVEN:    Parity control enabled and Even Parity is selected
 */
uint32_t USART_GetParity(const M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR1, (USART_CR1_PS | USART_CR1_PCE));
}

/**
 * @brief  Set USART data width.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] u32DataWidth            USART data width
 *         This parameter can be one of the following values:
 *           @arg USART_DATA_LENGTH_8BIT: 8 bits word length
 *           @arg USART_DATA_LENGTH_9BIT: 9 bits word length
 * @retval None
 */
void USART_SetDataWidth(M4_USART_TypeDef *USARTx, uint32_t u32DataWidth)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_DATA_WIDTH(u32DataWidth));

    MODIFY_REG32(USARTx->CR1, USART_CR1_M, u32DataWidth);
}

/**
 * @brief  Get USART data width.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_DATA_LENGTH_8BIT: 8 bits word length
 *           @arg USART_DATA_LENGTH_9BIT: 9 bits word length
 */
uint32_t USART_GetDataWidth(const M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR1, USART_CR1_M);
}

/**
 * @brief  Set USART oversampling bits.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] u32OversamplingBits     USART oversampling bits
 *         This parameter can be one of the following values:
 *           @arg USART_OVERSAMPLING_8BIT:    Oversampling by 8 bits
 *           @arg USART_OVERSAMPLING_16BIT:   Oversampling by 16 bits
 * @retval None
 */
void USART_SetOversmaplingBits(M4_USART_TypeDef *USARTx,
                                        uint32_t u32OversamplingBits)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_OVERSAMPLING_BITS(u32OversamplingBits));

    MODIFY_REG32(USARTx->CR1, USART_CR1_OVER8, u32OversamplingBits);
}

/**
 * @brief  Get USART oversampling bits.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_OVERSAMPLING_8BIT:    Oversampling by 8 bits
 *           @arg USART_OVERSAMPLING_16BIT:   Oversampling by 16 bits
 */
uint32_t USART_GetOversmaplingBits(const M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR1, USART_CR1_OVER8);
}

