RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_usart.c
/**
 * @brief  Set USART bit direction.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] u32BitDir               USART bit direction
 *         This parameter can be one of the following values:
 *           @arg USART_MSB:            MSB(Most Significant Bit)
 *           @arg USART_LSB:            LSB(Least Significant Bit)
 * @retval None
 */
void USART_SetBitDirection(M4_USART_TypeDef *USARTx, uint32_t u32BitDir)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_SIGNIFICANT_BIT(u32BitDir));

    MODIFY_REG32(USARTx->CR1, USART_CR1_ML, u32BitDir);
}

/**
 * @brief  Get USART bit direction.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_MSB:            MSB(Most Significant Bit)
 *           @arg USART_LSB:            LSB(Least Significant Bit)
 */
uint32_t USART_GetBitDirection(const M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR1, USART_CR1_ML);
}

/**
 * @brief  Set USART start bit detect polarity.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] u32Polarity             USART start bit detect polarity
 *         This parameter can be one of the following values:
 *           @arg USART_SB_DETECT_LOW:      Detect RX pin low level
 *           @arg USART_SB_DETECT_FALLING:  Detect RX pin falling edge
 * @retval None
 */
void USART_SetSbDetectPolarity(M4_USART_TypeDef *USARTx,
                                        uint32_t u32Polarity)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_SB_DETECT_POLARITY(u32Polarity));

    MODIFY_REG32(USARTx->CR1, USART_CR1_SBS, u32Polarity);
}

/**
 * @brief  Get USART start bit detect polarity.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_SB_DETECT_LOW:      Detect RX pin low level
 *           @arg USART_SB_DETECT_FALLING:  Detect RX pin falling edge
 */
uint32_t USART_GetSbDetectPolarity(const M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR1, USART_CR1_SBS);
}

/**
 * @brief  Set USART clock mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] u32ClkMode              USART clock mode
 *         This parameter can be one of the following values:
 *           @arg USART_EXTCLK:                Select external clock source.
 *           @arg USART_INTERNCLK_OUTPUT:      Select internal clock source and output clock.
 *           @arg USART_INTERNCLK_NONE_OUTPUT: Select internal clock source and don't output clock
 * @retval None
 */
void USART_SetClockMode(M4_USART_TypeDef *USARTx, uint32_t u32ClkMode)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_CLOCK_MODE(u32ClkMode));

    MODIFY_REG32(USARTx->CR2, USART_CR2_CLKC, u32ClkMode);
}

/**
 * @brief  Get USART clock mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_EXTCLK:                Select external clock source.
 *           @arg USART_INTERNCLK_OUTPUT:      Select internal clock source and output clock.
 *           @arg USART_INTERNCLK_NONE_OUTPUT: Select internal clock source and don't output clock
 */
uint32_t USART_GetClockMode(const M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR2, USART_CR2_CLKC);
}

/**
 * @brief  Set USART stop bits.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] u32StopBits             USART stop bits
 *         This parameter can be one of the following values:
 *           @arg USART_STOPBIT_1BIT:    1 stop bit
 *           @arg USART_STOPBIT_2BIT:    2 stop bits
 * @retval None
 */
void USART_SetStopBits(M4_USART_TypeDef *USARTx, uint32_t u32StopBits)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_STOP_BITS(u32StopBits));

    MODIFY_REG32(USARTx->CR2, USART_CR2_STOP, u32StopBits);
}

/**
 * @brief  Get USART clock mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_STOPBIT_1BIT:    1 stop bit
 *           @arg USART_STOPBIT_2BIT:    2 stop bits
 */
uint32_t USART_GetStopBits(const M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR2, USART_CR2_STOP);
}

/**
 * @brief  USART receive data.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @retval Receive data
 */
uint16_t USART_RecData(const M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

