RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_usart.c
    return READ_REG32_BIT(USARTx->CR2, USART_CR2_SBK) ? Set : Reset;
}

/**
 * @brief  Set send break mode for USART LIN.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] u32Mode                 USART send break mode
 *         This parameter can be one of the following values:
 *           @arg USART_LIN_SEND_BREAK_MODE_SBK: Start send break after USART_CR2 SBK bit set 1 value
 *           @arg USART_LIN_SEND_BREAK_MODE_TDR: Start send break after USART_DR TDR write 0x00 value
 * @retval None
 * @note   LIN feature is supported by M4_USART5/M4_USART10
 */
void USART_SetLinBreakMode(M4_USART_TypeDef *USARTx, uint32_t u32Mode)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_LIN_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_LIN_SEND_BREAK_MODE(u32Mode));

    MODIFY_REG32(USARTx->CR2, USART_CR2_SBKM, u32Mode);
}

/**
 * @brief  Get send break mode for USART LIN.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_LIN_SEND_BREAK_MODE_SBK: Start send break after USART_CR2 SBK bit set 1 value
 *           @arg USART_LIN_SEND_BREAK_MODE_TDR: Start send break after USART_DR TDR write 0x00 value
 * @note   LIN feature is supported by M4_USART5/M4_USART10
 */
uint32_t USART_GetLinBreakMode(const M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_LIN_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR2, USART_CR2_SBKM);
}

/**
 * @brief  Set UART half/full duplex selection.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] u32Mode                 USART half/full duplex selection
 *         This parameter can be one of the following values:
 *           @arg USART_HALFDUPLEX_MODE:USART half-duplex mode
 *           @arg USART_FULLDUPLEX_MODE:USART full-duplex mode
 * @retval None
 */
void USART_SetDuplexMode(M4_USART_TypeDef *USARTx, uint32_t u32Mode)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));
    DDL_ASSERT(IS_UART_DUPLEX_MODE(u32Mode));

    MODIFY_REG32(USARTx->CR3, USART_CR3_HDSEL, u32Mode);
}

/**
 * @brief  Get USART half/full duplex.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_HALFDUPLEX_MODE:USART half-duplex mode
 *           @arg USART_FULLDUPLEX_MODE:USART full-duplex mode
 */
uint32_t USART_GetDuplexMode(const M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR3, USART_CR3_HDSEL);
}

/**
 * @brief  Set UART hardware flow control CTS/RTS selection.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] u32HwFlowCtrl           USART hardware flow control CTS/RTS selection
 *         This parameter can be one of the following values:
 *           @arg USART_HWFLOWCTRL_NONE Disable USART hardware flow control
 *           @arg USART_HWFLOWCTRL_CTS: UART hardware flow control CTS mode
 *           @arg USART_HWFLOWCTRL_RTS: UART hardware flow control RTS mode
 *           @arg USART_HWFLOWCTRL_RTS_CTS: UART hardware flow control RTS and CTS mode
 * @retval None
 */
void USART_SetHwFlowCtrl(M4_USART_TypeDef *USARTx, uint32_t u32HwFlowCtrl)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_HWFLOWCTRL(u32HwFlowCtrl));

    MODIFY_REG32(USARTx->CR3, (USART_CR3_RTSE | USART_CR3_CTSE), u32HwFlowCtrl);
}

/**
 * @brief  Get USART hardware flow control CTS/RTS selection.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_HWFLOWCTRL_NONE: Disable USART hardware flow control
 *           @arg USART_HWFLOWCTRL_CTS: UART hardware flow control CTS mode
 *           @arg USART_HWFLOWCTRL_RTS: UART hardware flow control RTS mode
 *           @arg USART_HWFLOWCTRL_RTS_CTS: UART hardware flow control RTS and CTS mode
 */
uint32_t USART_GetHwFlowCtrl(const M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

