RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_usart.c
    return READ_REG32_BIT(USARTx->CR3, (USART_CR3_RTSE | USART_CR3_CTSE));
}

/**
 * @brief  Set USART Smartcard ETU Clock.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 * @param  [in] u32EtuClk               USART Smartcard ETU Clock.
 *         This parameter can be one of the following values:
 *           @arg USART_SC_ETU_CLK_32:  1 etu = 32/f
 *           @arg USART_SC_ETU_CLK_64:  1 etu = 64/f
 *           @arg USART_SC_ETU_CLK_128: 1 etu = 128/f
 *           @arg USART_SC_ETU_CLK_256: 1 etu = 256/f
 *           @arg USART_SC_ETU_CLK_372: 1 etu = 372/f
 * @retval None
 * @note   Smartcard feature is unsupported by M4_USART5/M4_USART10
 */
void USART_SetSmartcardEtuClk(M4_USART_TypeDef *USARTx,
                                    uint32_t u32EtuClk)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_SMARTCARD_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_SMARTCARD_ETU_CLK(u32EtuClk));

    MODIFY_REG32(USARTx->CR3, USART_CR3_BCN, u32EtuClk);
}

/**
 * @brief  Get USART Smartcard ETU Clock.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_SC_ETU_CLK_32:  1 etu = 32/f
 *           @arg USART_SC_ETU_CLK_64:  1 etu = 64/f
 *           @arg USART_SC_ETU_CLK_128: 1 etu = 128/f
 *           @arg USART_SC_ETU_CLK_256: 1 etu = 256/f
 *           @arg USART_SC_ETU_CLK_372: 1 etu = 372/f
 * @note   Smartcard feature is unsupported by M4_USART5/M4_USART10
 */
uint32_t USART_GetSmartcardEtuClk(const M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_SMARTCARD_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR3, USART_CR3_BCN);
}

/**
 * @brief  Set USART clock prescaler division.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] u32PclkDiv              USART clock prescaler division.
 *         This parameter can be one of the following values:
 *           @arg USART_PCLK_DIV1:     PCLK
 *           @arg USART_PCLK_DIV4:     PCLK/4
 *           @arg USART_PCLK_DIV16:    PCLK/16
 *           @arg USART_PCLK_DIV64:    PCLK/64
 * @retval None
 * @note   The PCLK division function is valid when clock source is PCLK
 */
void USART_SetPclkDiv(M4_USART_TypeDef *USARTx,
                                uint32_t u32PclkDiv)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_PCLK_DIV(u32PclkDiv));

    MODIFY_REG32(USARTx->PR, USART_PR_PSC, u32PclkDiv);
}

/**
 * @brief  Get USART clock prescaler division.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_PCLK_DIV1:     PCLK
 *           @arg USART_PCLK_DIV4:     PCLK/4
 *           @arg USART_PCLK_DIV16:    PCLK/16
 *           @arg USART_PCLK_DIV64:    PCLK/64
 * @note   The PCLK division function is valid when clock source is PCLK
 */
uint32_t USART_GetPclkDiv(const M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->PR, USART_PR_PSC);
}

/**
 * @brief  Set USART LIN counter clock prescaler division.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] u32PclkDiv              USART USART LIN counter clock prescaler division.
 *         This parameter can be one of the following values:
 *           @arg USART_LIN_BMC_PCLK_DIV1: PCLK
 *           @arg USART_LIN_BMC_PCLK_DIV2: PCLK/2
 *           @arg USART_LIN_BMC_PCLK_DIV4: PCLK/4
 *           @arg USART_LIN_BMC_PCLK_DIV8: PCLK/8
 * @retval None
 * @note   LIN feature is supported by M4_USART5/M4_USART10
 * @note   The PCLK division function is valid when clock source is PCLK
 */
void USART_SetLinBmcPclkDiv(M4_USART_TypeDef *USARTx,
                                        uint32_t u32PclkDiv)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_LIN_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_LIN_BMC_PCLK_DIV(u32PclkDiv));

    MODIFY_REG32(USARTx->PR, USART_PR_LBMPSC, u32PclkDiv);
}

/**
 * @brief  Get USART LIN counter clock prescaler division.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_LIN_BMC_PCLK_DIV1: PCLK
 *           @arg USART_LIN_BMC_PCLK_DIV2: PCLK/2
 *           @arg USART_LIN_BMC_PCLK_DIV4: PCLK/4
 *           @arg USART_LIN_BMC_PCLK_DIV8: PCLK/8
 * @note   LIN feature is supported by M4_USART5/M4_USART10
 */
uint32_t USART_GetLinBmcPclkDiv(const M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_LIN_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->PR, USART_PR_LBMPSC);
}

/**
 * @brief  Set stop mode noise filter.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 * @param  [in] u32Filter               The noise filter value
 *         This parameter can be one of the following values:
 *           @arg USART_STOP_MODE_FILTER_NONE:          Disable noise filter
 *           @arg USART_STOP_MODE_FILTER_WIDTH_LEVEL_1: Filter width level 1
 *           @arg USART_STOP_MODE_FILTER_WIDTH_LEVEL_2: Filter width level 2
 *           @arg USART_STOP_MODE_FILTER_WIDTH_LEVEL_3: Filter width level 3
 *           @arg USART_STOP_MODE_FILTER_WIDTH_LEVEL_4: Filter width level 4
 * @retval None
 * @note   The stop mode noise filter is supported by M4_USART1
 */
void USART_SetStopModeNoiseFilter(const M4_USART_TypeDef *USARTx,
                                            uint32_t u32Filter)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_STOPMODE_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_STOPMODE_FILTER(u32Filter));

    WRITE_REG32(M4_PERIC->USART1_NFC, u32Filter);
}

/**
 * @brief  Disable UART multiple processor function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_STOP_MODE_FILTER_NONE:          Disable noise filter
 *           @arg USART_STOP_MODE_FILTER_WIDTH_LEVEL_1: Filter width level 1
 *           @arg USART_STOP_MODE_FILTER_WIDTH_LEVEL_2: Filter width level 2
 *           @arg USART_STOP_MODE_FILTER_WIDTH_LEVEL_3: Filter width level 3
 *           @arg USART_STOP_MODE_FILTER_WIDTH_LEVEL_4: Filter width level 4
 * @note   The stop mode noise filter is supported by M4_USART1
 */
uint32_t USART_GetStopModeNoiseFilter(const M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_STOPMODE_INSTANCE(USARTx));

    return READ_REG32_BIT(M4_PERIC->USART1_NFC, (PERIC_USART1_NFC_NFE | PERIC_USART1_NFC_NFS));
}

/**
 * @brief  Enable/disable USART LIN Function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] u32Func                 USART function type
 *         This parameter can be any composed value of the following values:
 *           @arg USART_LIN:            USART LIN function
 *           @arg USART_LIN_WKUP:       USART LIN wakeup signal detect function
 *           @arg USART_LIN_INT_WKUP:   USART LIN wakeup signal detect interrupt function
 *           @arg USART_LIN_BUSERR:     USART LIN bus error detect function
 *           @arg USART_LIN_INT_BUSERR: USART LIN bus error detect interrupt function
 *           @arg USART_LIN_INT_BREAK:  USART LIN break field detect interrupt function
 * @param  [in] enNewState              The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 * @note   LIN feature is supported by M4_USART5/M4_USART10
 */
void USART_LinFuncCmd(M4_USART_TypeDef *USARTx,
                            uint32_t u32Func,
                            en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_LIN_INSTANCE(USARTx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_USART_LIN_FUNCTION(u32Func));

    (Enable == enNewState) ? SET_REG32_BIT(USARTx->CR2, u32Func) : CLEAR_REG32_BIT(USARTx->CR2, u32Func);
}

/**
 * @brief  Get USART LIN function state.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] u32Func                 USART function type
 *         This parameter can be one of the following values:
 *           @arg USART_LIN:            USART LIN function
 *           @arg USART_LIN_WKUP:       USART LIN wakeup signal detect function
 *           @arg USART_LIN_INT_WKUP:   USART LIN wakeup signal detect interrupt function
 *           @arg USART_LIN_BUSERR:     USART LIN bus error detect function
 *           @arg USART_LIN_INT_BUSERR: USART LIN bus error detect interrupt function
 *           @arg USART_LIN_INT_BREAK:  USART LIN break field detect interrupt function
 * @retval An en_functional_state_t enumeration value:
 *           - Enable: Enable function
 *           - Disable: Disable function
 * @note   LIN feature is supported by M4_USART5/M4_USART10
 */
en_functional_state_t USART_GetLinFuncState(const M4_USART_TypeDef *USARTx,
                                                    uint32_t u32Func)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_LIN_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_FUNCTION(u32Func));

    return (READ_REG32_BIT(USARTx->CR2, u32Func) ? Enable : Disable);
}

/**
 * @brief  Get USART LIN baudrate measure count.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @retval LIN baudrate measure count value
 * @note   LIN feature is supported by M4_USART5/M4_USART10
 */
uint32_t USART_GetLinMeasureCnt(const M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_LIN_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->LBMC, USART_LBMC_LBMC);
}

/**
 * @brief  Get USART LIN baudrate measure count.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @retval LIN baudrate measure count value
 * @note   LIN feature is supported by M4_USART5/M4_USART10
 */
uint32_t USART_GetLinMeasureBaudrate(const M4_USART_TypeDef *USARTx)
{
    uint32_t u32BmClk;
    uint32_t u32BmDiv;
    uint32_t u32LBMC;

    /* Check parameters */
    DDL_ASSERT(IS_USART_LIN_INSTANCE(USARTx));

    u32BmDiv = USART_BMC_DIV(USARTx);
    u32BmClk = PCLK_FREQ / u32BmDiv;
    u32LBMC = READ_REG32_BIT(USARTx->LBMC, USART_LBMC_LBMC);

    return (u32LBMC > 0UL) ? (u32BmClk / u32LBMC) : 0UL;
}

/**
 * @brief  Set USART LIN break detection length.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART5:            USART unit 1 instance register base
 *           @arg M4_USART10:           USART unit 2 instance register base
 * @param  [in] u32Len                  USART clock prescaler division.
 *         This parameter can be one of the following values:
 *           @arg USART_LIN_DETECT_BREAK_10BIT: 10-bit break detection
 *           @arg USART_LIN_DETECT_BREAK_11BIT: 11-bit break detection
 * @retval None
 * @note   LIN feature is supported by M4_USART5/M4_USART10
 */
void USART_SetLinDetectBreakLen(M4_USART_TypeDef *USARTx,
                                        uint32_t u32Len)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_LIN_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_LIN_DETECT_BREAK_LEN(u32Len));

    MODIFY_REG32(USARTx->CR2, USART_CR2_LBDL, u32Len);
}

/**
 * @brief  Get USART LIN break detection length.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART5:            USART unit 1 instance register base
 *           @arg M4_USART10:           USART unit 2 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_LIN_DETECT_BREAK_10BIT: 10-bit break detection
 *           @arg USART_LIN_DETECT_BREAK_11BIT: 11-bit break detection
 * @note   LIN feature is supported by M4_USART5/M4_USART10
 */
uint32_t USART_GetLinDetectBreakLen(const M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_LIN_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR2, USART_CR2_LBDL);
}

/**
 * @brief  Set USART LIN break sending length.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART5:            USART unit 1 instance register base
 *           @arg M4_USART10:           USART unit 2 instance register base
 * @param  [in] u32Len                  USART clock prescaler division.
 *         This parameter can be one of the following values:
 *           @arg USART_LIN_SEND_BREAK_10BIT: Send break 10-bit
 *           @arg USART_LIN_SEND_BREAK_11BIT: Send break 11-bit
 *           @arg USART_LIN_SEND_BREAK_13BIT: Send break 13-bit
 *           @arg USART_LIN_SEND_BREAK_14BIT: Send break 14-bit
 * @retval None
 * @note   LIN feature is supported by M4_USART5/M4_USART10
 */
void USART_SetLinSendBreakLen(M4_USART_TypeDef *USARTx, uint32_t u32Len)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_LIN_INSTANCE(USARTx));
    DDL_ASSERT(IS_USART_LIN_SEND_BREAK_LEN(u32Len));

    MODIFY_REG32(USARTx->CR2, USART_CR2_SBKL, u32Len);
}

/**
 * @brief  Get USART LIN break detection length.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART5:            USART unit 1 instance register base
 *           @arg M4_USART10:           USART unit 2 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg USART_LIN_SEND_BREAK_10BIT: Send break 10-bit
 *           @arg USART_LIN_SEND_BREAK_11BIT: Send break 11-bit
 *           @arg USART_LIN_SEND_BREAK_13BIT: Send break 13-bit
 *           @arg USART_LIN_SEND_BREAK_14BIT: Send break 14-bit
 * @note   LIN feature is supported by M4_USART5/M4_USART10
 */
uint32_t USART_GetLinSendBreakLen(const M4_USART_TypeDef *USARTx)
{
    /* Check parameters */
    DDL_ASSERT(IS_USART_LIN_INSTANCE(USARTx));

    return READ_REG32_BIT(USARTx->CR2, USART_CR2_SBKL);
}

/**
 * @brief  Set USART baudrate.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART5:            USART unit 5 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 *           @arg M4_USART10:           USART unit 10 instance register base
 * @param  [in] u32Baudrate             UART baudrate
 * @param  [out] pf32Err                E(%) baudrate error rate
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: set unsuccessfully
 */
en_result_t USART_SetBaudrate(M4_USART_TypeDef *USARTx,
                                    uint32_t u32Baudrate,
                                    float32_t *pf32Err)
{
    uint32_t u32Mode;
    uint32_t u32BrrVal = 0UL;
    uint32_t u32FractEn = 0UL;
    uint32_t u32UsartClk;
    uint32_t u32UsartDiv;
    en_result_t enRet;

    /* Check parameter */
    DDL_ASSERT(u32Baudrate > 0UL);
    DDL_ASSERT(IS_USART_INSTANCE(USARTx));

    /* Get USART clock frequency */
    u32UsartDiv = USART_DIV(USARTx);
    u32UsartClk = PCLK_FREQ / u32UsartDiv;

    u32Mode = READ_REG32_BIT(USARTx->CR3, USART_CR3_SCEN);
    if (u32Mode > 0UL)
    {
        /* Smart card */
        enRet = CalcSmartcardBaudrate(USARTx, u32UsartClk, u32Baudrate, &u32BrrVal, &u32FractEn, pf32Err);
    }
    else
    {
        u32Mode = READ_REG32_BIT(USARTx->CR1, USART_CR1_MS);
        if (u32Mode > 0UL)
        {
            /* Clock synchronization */
            enRet = CalcClkSyncBaudrate(USARTx, u32UsartClk, u32Baudrate, &u32BrrVal, &u32FractEn, pf32Err);
        }
        else
        {
            /* UART */
            enRet = CalcUartBaudrate(USARTx, u32UsartClk, u32Baudrate, &u32BrrVal, &u32FractEn, pf32Err);
        }
    }

