RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_usart.c
    C = u32UsartClk;
    B = u32Baudrate;

    if ((C > 0UL) && (B > 0UL))
    {
        /* Clock sync mode baudrate integer calculation formula:    */
        /*          B = C / (4 * (DIV_Integer + 1))                 */
        /*          DIV_Integer = (C / (B * 4)) - 1                 */
        DIV = ((float)C / ((float)B * 4.0F)) - 1.0F;
        DIV_Integer = (uint32_t)DIV;
        DDL_ASSERT((DIV > 0.0F) && (DIV_Integer <= 0xFFUL));

        u64Temp = (uint64_t)((uint64_t)4U * ((uint64_t)DIV_Integer + (uint64_t)1UL) * (uint64_t)B);

        if (IS_USART_FRACTION_INSTANCE(USARTx))
        {
            if ((DIV - (float32_t)DIV_Integer) > 0.00001F)
            {
                /* Clock sync mode baudrate fraction calculation formula:               */
                /*      B = C * (128 + DIV_Fraction) / (4 * (DIV_Integer + 1) * 256)    */
                /*      DIV_Fraction = 256 * (4 * (DIV_Integer + 1) * B / C - 128       */
                DIV_Fraction = (uint32_t)(256UL * u64Temp / C - 128UL);
                if (DIV_Fraction > 0x7FUL)
                {
                    enRet = ErrorInvalidParameter;
                }
            }
        }

        if (Ok == enRet)
        {
            *pu32FractEn = (DIV_Fraction > 0UL) ? USART_CR1_FBME : 0UL;
            *pu32BrrVal = DIV_Fraction + (uint32_t)(DIV_Integer << USART_BRR_DIV_INTEGER_POS);

            if (NULL != pf32Err)
            {
                if (0UL == DIV_Fraction)
                {
                    /* E(%) = C / (4 * (DIV_Integer + 1) * B) - 1 */
                    f32Err = (float32_t)((float64_t)C / (float64_t)u64Temp) - 1.0F;
                }
                else
                {
                    /* E(%) = C * (128 + DIV_Fraction) / (4 * (DIV_Integer + 1) * B * 256) - 1 */
                    u64Temp *= (uint64_t)256UL;
                    u64Dividend = (uint64_t)C * ((uint64_t)128UL + (uint64_t)DIV_Fraction);
                    f32Err = (float32_t)((float64_t)(u64Dividend) / (float64_t)(u64Temp)) - 1.0F;
                }

                *pf32Err = f32Err;
            }
        }
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;
}

/**
 * @brief  Calculate baudrate for smart-card mode.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 *           @arg M4_USART6:            USART unit 6 instance register base
 *           @arg M4_USART7:            USART unit 7 instance register base
 *           @arg M4_USART8:            USART unit 8 instance register base
 *           @arg M4_USART9:            USART unit 9 instance register base
 * @param  [in] u32UsartClk             USART clock
 * @param  [in] u32Baudrate             UART baudrate
 * @param  [out] pu32BrrVal             Pointer to BRR register value
 * @param  [out] pu32FractEn            Pointer to CR1 FBME bit value
 * @param  [out] pf32Err                E(%) baudrate error rate
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: set unsuccessfully
 * @note   Smartcard feature is unsupported by M4_USART5/M4_USART10
 */
static en_result_t CalcSmartcardBaudrate(const M4_USART_TypeDef *USARTx,
                                            uint32_t u32UsartClk,
                                            uint32_t u32Baudrate,
                                            uint32_t *pu32BrrVal,
                                            uint32_t *pu32FractEn,
                                            float32_t *pf32Err)
{
    uint32_t B;
    uint32_t C;
    uint32_t BCN;
    float32_t DIV;
    uint64_t u64Temp;
    uint64_t u64Dividend;
    uint32_t DIV_Integer;
    uint32_t DIV_Fraction = 0UL;
    const uint16_t au16EtuClkCnts[] = {32U, 64U, 93U, 128U, 186U, 256U, 372U, 512U};
    float32_t f32Err;
    en_result_t enRet = Ok;

    /* Check parameter */
    DDL_ASSERT(IS_USART_SMARTCARD_INSTANCE(USARTx));

    C = u32UsartClk;
    B = u32Baudrate;

    if ((C > 0UL) && (B > 0UL))
    {
        BCN = READ_REG32_BIT(USARTx->CR3, USART_CR3_BCN);
        DDL_ASSERT(IS_USART_SMARTCARD_ETU_CLK(BCN));
        BCN = au16EtuClkCnts[BCN >> USART_CR3_BCN_POS];

        /* Smartcard mode baudrate integer calculation formula: */
        /*      B = C / (2 * BCN * (DIV_Integer + 1))           */
        /*      DIV_Integer = (C / (B * 2 * BCN)) - 1           */
        DIV = ((float)C / ((float)B * (float)BCN * 2.0F)) - 1.0F;
        DIV_Integer = (uint32_t)DIV;

        DDL_ASSERT((DIV > 0.0F) && (DIV_Integer <= 0xFFUL));

        u64Temp = (uint64_t)((uint64_t)2UL * BCN * ((uint64_t)DIV_Integer + (uint64_t)1UL) * B);

        if (IS_USART_FRACTION_INSTANCE(USARTx))
        {
            if ((DIV - (float32_t)DIV_Integer) > 0.00001F)
            {
                /* Smartcard mode baudrate fraction calculation formula:                        */
                /*      B = C * (128 + DIV_Fraction) / ((2 * BCN) * (DIV_Integer + 1) * 256)    */
                /*      DIV_Fraction = (256 * (2 * BCN * (DIV_Integer + 1) * B) / C) - 128      */
                DIV_Fraction = (uint32_t)(256UL * u64Temp / C - 128UL);
                if (DIV_Fraction > 0x7FUL)
                {
                    enRet = ErrorInvalidParameter;
                }
            }
        }

        if (Ok == enRet)
        {
            *pu32FractEn = (DIV_Fraction > 0UL )? USART_CR1_FBME : 0UL;
            *pu32BrrVal = DIV_Fraction + (uint32_t)(DIV_Integer << USART_BRR_DIV_INTEGER_POS);

            if (NULL != pf32Err)
            {
                if (0UL == DIV_Fraction)
                {
                    /* E(%) = C / (2 * BCN * (DIV_Integer + 1) * B) - 1 */
                    f32Err = (float32_t)((float64_t)C / (float64_t)u64Temp) - 1.0F;
                }
                else
                {
                    /* E(%) = C * (128 + DIV_Fraction) / (2 * BCN * (DIV_Integer + 1) * B * 256) - 1 */
                    u64Temp *= (uint64_t)256UL;
                    u64Dividend = (uint64_t)C * ((uint64_t)128UL + (uint64_t)DIV_Fraction);
                    f32Err = (float32_t)((float64_t)u64Dividend / (float64_t)(u64Temp)) - 1.0F;
                }

                *pf32Err = f32Err;
            }
        }
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;
}

/**
 * @}
 */

#endif /* DDL_USART_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
